word = 'turkmenistan'
len(word) #счет букв в слове
word.split() #разбивает строки по раздилителю
word.rstrip() #убирает пробел в правом конце
word.lstrip() #убирает пробел в левом конце
word.strip() #убирает пробел справо и слево
word.title() #первую букву делает заглавной
word.upper() #все буквы делает большими
word.lower() #все буквы делает маленькими
word.capitalize() #первую букву делает заглавной а остальные маленькими
word.swapcase() #переводит маленькие буквы в заглавные а заглавные в маленькие